Repository: blindpandas/spellcheck
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, fa, tr

source: Downloaded: {progress}%
ar: نسبة التحميل: {progress}%
fa: {progress}% دانلود شد
tr: İndirildi: %{progress}

source: Successfully downloaded dictionary for language {lang}
ar: تم تحميل قاموس اللغة {lang} بنجاح
fa: واژه‌نامه‌ی زبانِ {lang} با موفقیت دانلود شد
tr: {lang} Dili için sözlük başarıyla indirildi

source: Dictionary Downloaded
ar: تم تحميل القاموس
fa: دیکشنری دانلود شد
tr: Sözlük İndirildi

source: Cannot download dictionary for language {lang}. Please check your connection and try again.
ar: لا يمكن تحميل قاموس اللغة {lang}. يرجى التحقق من اتصالك بالشبكة ثم المحاولة لاحقاً.
fa: نتوانستم واژه‌نامه‌ی زبانِ {lang} را دانلود کنم. لطفا اتصال به اینترنت را بررسی کرده و دوباره تلاش کنید.
tr: {lang} dili için sözlük indirilemiyor. Lütfen bağlantınızı kontrol edin ve tekrar deneyin.

source: Download Failed
ar: فشل التحميل
fa: دانلود ناموفق بود
tr: İndirme başarısız

source: Dictionary for language {lang} is missing. Would you like to download it?
ar: لا تمتلك قاموس اللغة {lang}. هل ترغب في تحميله؟
fa: واژه‌نامه‌ی زبانِ {lang} نیست. میخواهید دانلودش کنید؟
tr: {lang} dili için kaydedilmiş bir sözlük yok. İndirmek ister misiniz?

source: Download Language Dictionary
ar: تحميل قاموس اللغة
fa: دانلودِ واژه‌نامه‌ی زبان
tr: Dil Sözlüğünü İndir

source: Downloading Dictionary For Language {lang}
ar: يجري تحميل قاموس اللغة {lang}
fa: در حالِ دانلودِ واژه‌نامه برای زبانِ {lang}
tr: {lang} dili için sözlük indiriliyor

source: Retrieving download information...
ar: يجري الحصول على معلومات التحميل
fa: بازیابیِ اطلاعاتِ دانلود...
tr: İndirme bilgileri alınıyor...

source: Checks spelling errors for the selected text using the current input language
ar: التحقق من الأخطاء الإملائية للنص المحدد باستخدام لغة الإدخال الحالية
fa: خطاهای املاییِ متنِ انتخاب‌شده را با استفاده از زبانِ ورودیِ جاری بررسی میکند
tr: Geçerli giriş dilini kullanarak seçilen metin için yazım hatalarını kontrol eder

source: Toggles the method used in determining the language for spellchecking: user-chosen versus current input language
ar: تبديل الطريقة المستخدمة في تحديد لغة التدقيق الإملائي بين لغة يختارها المستخدم ولغة الإدخال الحالية
fa: روشِ تعیینِ زبانِ غلط‌یابی را میانِ انتخابِ کاربر و زبانِ ورودیِ جاری تغییر میدهد
tr: Yazım denetimi dilini belirlemede kullanılan yöntemi değiştirir: mevcut giriş dili veya kullanıcı tarafından seçilecek bir dil olarak iki ayrı yol kullanılabilir

source: Dialog is already open
ar: مربع الحوار مفتوح بالفعل
fa: پنجره از قبل باز است
tr: İletişim kutusu zaten açık

source: Please choose the language you want to use for spellchecking.
ar: الرجاء اختيار اللغة التي تريد استخدامها للتدقيق الإملائي.
fa: لطفا زبانی را که میخواهید برای غلط‌یابی استفاده شود انتخاب کنید.
tr: Lütfen yazım denetimi için kullanmak istediğiniz dili seçin.

source: Choose Spellcheck Language
ar: اختر لغة Spellcheck.
fa: زبانِ غلط‌یابی را انتخاب کنید
tr: Yazım Denetimi Dilini Seçin

source: Using the active Input language for spellchecking
ar: استخدام لغة الإدخال الحالية للتدقيق الإملائي
fa: در حالِ استفاده از زبانِ ورودیِ فعال برای غلط‌یابی
tr: Yazım denetimi için etkin Giriş dilini kullan

source: Spelling Errors
ar: الأخطاء الإملائية
fa: خطاهای املایی
tr: Yazım Hataları

source: No spelling mistakes
fa: هیچ خطایی موجود نیست
tr: yazım hatası yok

source: Dialects found for language {lang}. Please select the one you want to download.
ar: تم إيجاد لهجات للّغة {lang}. الرجاء اختيار قاموس اللهجة الذي تريد تحميله.
fa: گویش‌هایی برای زبانِ {lang} پیدا شد. یکی را برای دانلود انتخاب کنید.
tr: {lang} dili için lehçeler bulundu. Lütfen indirmek istediğinizi seçin.

source: Dialects Found
ar: اللهجات الموجودة
fa: گویش‌هایی پیدا شدند
tr: Bulunan lehçeler

source: Language dictionary for language {lang} is not available.
ar: لا يتوفر قاموس للّغة {lang}.
fa: واژه‌نامه‌ی زبان برای زبانِ {lang} موجود نیست
tr: {lang} dili için dil sözlüğü mevcut değil.

source: Spellchecking is not supported here
ar: التدقيق الإملائي غير مدعوم هنا
fa: غلط‌یابی در اینجا پشتیبانی نمیشود
tr: Yazım denetimi burada desteklenmiyor

source: No text is selected
ar: لم يتم تحديد نص
fa: متنی انتخاب نشده است
tr: Seçili Metin yok

source: Spellcheck
fa: غلط‌یاب
tr: Yazım denetimi

source: accepted: {choice.name}
fa: پذیرفته شد: {choice.name}
tr: Kabul edildi: {choice.name}

source: Added to personal dictionary
ar: تمت الإضافة إلى القاموس الشخصي
fa: به واژه‌نامه‌ی شخصی افزوده شد
tr: Kişisel sözlüğe eklendi

source: Ignore for this session
ar: تجاهل هذه المرة
fa: این بار نادیده بگیر
tr: Bu defa yoksay

source: Add to dictionary
ar: إضافة إلى القاموس
fa: به واژه‌نامه اضافه کن
tr: sözlüğe ekle

source: Copies the corrected text to the clipboard
ar: ينسخ النص المصحح إلى الحافظة
fa: متنِ تصحیح‌شده را در کلیپ‌برد کپی میکند
tr: Düzeltilen metni panoya kopyalar

source: Replaces the text in the edit field with the corrected text
ar: يستبدل النص في حقل التعديل بالنص المصحح
fa: متنِ داخل کادر ویرایشی را با متن تصحیح‌شده جایگزین میکند
tr: Yazı alanındaki metni düzeltilmiş metinle değiştirir

source: No misspellings
ar: لا أخطاء إملائية
fa: بدونِ خطای املایی
tr: yazım hatası yok

source: Can not replace text, the text field is read only
ar: لا يمكن استبدال النص، حقل النص للقراءة فقط
fa: نمیتوانم متن را جایگزین کنم. متن فقط‌خواندنی است.
tr: Metin değiştirilemiyor, Bu alan salt okunur

source: The Spellcheck add-on comes bundled with some default language dictionaries. Would you like to add them?
ar: تأتي مع إضافة Spellcheck بعض قواميس اللغات الافتراضية، فهل ترغب في إضافتها؟
fa: افزونه‌ی غلط‌یاب همراه است با چند واژه‌نامه‌ی زبانِ پیش‌فرض. میخواهید آن‌ها را اضافه کنید؟
tr: Yazım Denetimi eklentisi, bazı varsayılan dil sözlükleriyle birlikte gelir. Onları eklemek ister misiniz?

source: Add Default Dictionaries
ar: إضافة القواميس الافتراضية
fa: افزودنِ واژه‌نامه‌های پیش‌فرض
tr: Varsayılan Sözlükleri Ekle

source: accepted: {suggestion}
ar: تم قبوله: {suggestion}

source: A multilingual spellchecker. Detects spelling mistakes in current selection and provide correction suggestions.
ar: مدقق إملائي متعدد اللغات. يكتشف الأخطاء الإملائية في النص المحدد ويقدم تصحيحاته المقترحة.
